//
//  OrderManager.swift
//  DominoOrder
//
//  Created by 순진이 on 2021/12/06.
//

import Foundation

class OrderManager {
    static let shared = OrderManager()
    
    var wishDictionary: [String:Int] = [:]
    var keysDictionary: [String] = []
    var valuesDictionary: [Int] = []
    
    
    var menuPrice = ["글램핑 바비큐": 30000, "알로하 하와이안": 23000, "우리 고구마": 25000, "콰트로 치즈 퐁듀": 28000, "더블크러스트 이베리코": 15000, "블랙앵거스 스테이크": 15000, "블랙타이거 슈림프": 15000, "와규 앤 비스테카": 15000, "직화 스테이크": 15000, "베이컨체더치즈": 10000, "불고기": 10000, "슈퍼디럭스": 10000, "슈퍼슈프림": 10000, "페퍼로니": 10000, "포테이토": 10000, "딸기 슈크림": 1000, "슈퍼곡물 치킨": 15000, "애플 크러스트 디저트": 4000, "치킨퐁듀 그라탕": 12000, "퀴노아 치킨 샐러드": 13000, "포테이토 순살치킨": 15000, "미닛메이드 스파클링 청포도": 1000, "스프라이트": 1000, "코카콜라 제로": 1000, "코카콜라": 1000, "갈릭 디핑 소스": 2000, "스위트 칠리소스": 1000, "우리 피클 L": 1000, "우리 피클 M": 800, "핫소스": 500
    ]
    
    var menuQuantity = ["글램핑 바비큐": 0, "알로하 하와이안": 0, "우리 고구마": 0, "콰트로 치즈 퐁듀": 0, "더블크러스트 이베리코": 0, "블랙앵거스 스테이크": 0, "블랙타이거 슈림프": 0, "와규 앤 비스테카": 0, "직화 스테이크": 0, "베이컨체더치즈": 0, "불고기": 0, "슈퍼디럭스": 0, "슈퍼슈프림": 0, "페퍼로니": 0, "포테이토": 0, "딸기 슈크림": 0, "슈퍼곡물 치킨": 0, "애플 크러스트 디저트": 0, "치킨퐁듀 그라탕": 0, "퀴노아 치킨 샐러드": 0, "포테이토 순살치킨": 0, "미닛메이드 스파클링 청포도": 0, "스프라이트": 0, "코카콜라 제로": 0, "코카콜라": 0, "갈릭 디핑 소스": 0, "스위트 칠리소스": 0, "우리 피클 L": 0, "우리 피클 M": 0, "핫소스": 0
    ]
    
    private init() {}
    
}
